#+title: Test

* Test

** pre
#+name: pre
#+begin_src lua :exports none
local output, status, _type, rc = hs.execute("/opt/homebrew/bin/yabai -m query --windows")
print(output)
#+end_src

#+RESULTS: pre

#+begin_src sh :noweb-prefix no :noweb yes :results output
echo "test pre"
hs -c '<<pre>>'
#+end_src

#+RESULTS:
: test pre
** query
#+name: query
#+begin_src lua :exports none
local M = hs.loadSpoon("Yabai")
print(hs.inspect(M:windows()))
#+end_src

#+begin_src sh :noweb-prefix no :noweb yes :results output
echo "test query"
hs -c '<<query>>'
#+end_src

#+RESULTS:
: test query
: -- Spoon already loaded, returning existing copy: Yabai
: -- Loading extension: inspect
:
: 23:55:08 ERROR:   LuaSkin: Error deserialising JSON: The data couldn’t be read because it isn’t in the correct format.
: nil
